doc/slides/slide_specificite_c++.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Spécificités du C++ (indépendantes de la POO)</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="slide_compilation.html">Compilation & Directives de préprocesseur </a><a href="slide_pointeur.html">Pointeurs, Références & Allocation Dynamique de Mémoire </a><a href="slide_specificite_c++.html">Spécificités du C++ (indépendantes de la POO) </a><a href="slide_struct_class.html">Structures & Classes </a><a href="slide_encapsulation.html">Encapsulation des données </a><a href="slide_constructeur.html">Constructeur & Destructeur de classe </a><a href="slide_copie.html">Copie d'objets </a><a href="slide_amitie_surcharge.html">Amitié & Surcharge d'opérateur </a><a href="slide_heritage_1.html">Héritage (Partie 1) </a><a href="slide_heritage_2.html">Héritage (Partie 2) </a><a href="slide_template.html">Patrons de fonctions et de classes </a><a href="slide_STL.html">Introduction à la librairie standard </a>
                     <hr/>
                     <a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Spécificités du C++ (indépendantes de la POO)</h1><hr/>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Librairies standards &amp; Déclaration de variables</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Les librairies du C ont été optimisées aux besoins du C++
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Inclusion en C</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-comment-delimiter">// </span><span class="org-comment">Inclusion en C</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;math.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;time.h&gt;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Inclusion en C++</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-comment-delimiter">// </span><span class="org-comment">Inclusion en C++</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;cmath&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;ctime&gt;</span>
</pre>
</div>

<ul class="org-ul">
<li>Possibilité de déclarer les variables locales quel que soit l&rsquo;endroit
</li>
</ul>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">for</span> (<span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">i</span> = 0 ; i &lt; 10 ; i++)
  {...}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Arguments par défaut de fonctions</h2>
<div class="outline-text-2" id="text-2">
<p>
C++ autorise l&rsquo;utilisation de valeurs par défaut dans <b>les prototypes de
  fonction</b>
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-comment-delimiter">// </span><span class="org-comment">Prototype de fonction</span>
<span class="org-type">void</span> <span class="org-function-name">initialize</span> (<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">abs</span>, <span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">ord</span> = 0.0);

<span class="org-type">int</span> <span class="org-function-name">main</span> ()
{
  initialize (1.0);
}

<span class="org-type">void</span> <span class="org-function-name">initialize</span> (<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">abs</span>, <span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">ord</span>)
{ ... }
</pre>
</div>

<ul class="org-ul">
<li>En l&rsquo;absence de second argument, le compilateur assigne la valeur 0.0 à la
variable <code>ord</code>
</li>

<li>Les arguments concernés doivent <b>obligatoirement</b> être les <b>derniers</b> dans la
liste.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Surdéfinition (surcharge) de fonctions</h2>
<div class="outline-text-2" id="text-3">
<p>
En C++ deux fonctions peuvent porter le même nom dès lors qu&rsquo;elles n&rsquo;ont pas
les mêmes types d&rsquo;argument
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">void</span> <span class="org-function-name">dummy</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span>, <span class="org-type">double</span> <span class="org-variable-name">a</span>, <span class="org-type">char</span> <span class="org-variable-name">c</span>);
<span class="org-type">void</span> <span class="org-function-name">dummy</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span>, <span class="org-type">int</span> <span class="org-variable-name">a</span>, <span class="org-type">char</span> <span class="org-variable-name">c</span>);
<span class="org-type">void</span> <span class="org-function-name">dummy</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span>);
</pre>
</div>

<p>
Le compilateur se charge d&rsquo;appeler la &ldquo;bonne&rdquo; fonction par rapport au contexte
<i>i.e.</i> au vu de la liste d&rsquo;arguments donnée lors de l&rsquo;appel.
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">int</span> <span class="org-function-name">main</span> ()
{
  dummy (1, 1.0, <span class="org-string">'a'</span>);
  dummy (1, 1, <span class="org-string">'a'</span>);
  dummy (1);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Fonction <code>inline</code></h2>
<div class="outline-text-2" id="text-4">
<p>
<b>Les fonctions en ligne</b> remplacent (avantageusement) les macros utilisées en C
tout en conservant un temps d&rsquo;exécution plus court
</p>

<p>
On remplacera ainsi la déclaration en C
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-comment-delimiter">// </span><span class="org-comment">Macro en C</span>
<span class="org-preprocessor">#define</span> <span class="org-function-name">CARRE</span>(<span class="org-variable-name">x</span>) ((x) * (x))
</pre>
</div>
<p>
par
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-comment-delimiter">// </span><span class="org-comment">Fonction en ligne en C++</span>
<span class="org-keyword">inline</span> <span class="org-type">double</span> <span class="org-function-name">carre</span>(<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">x</span>) { <span class="org-keyword">return</span> x*x; }
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Le type <code>bool</code></h2>
<div class="outline-text-2" id="text-5">
<p>
Ce nouveau type est naturellement formé de deux valeurs notées <code>true</code> et <code>false</code>
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">bool</span> <span class="org-variable-name">is_ok</span> = <span class="org-constant">true</span>;
<span class="org-keyword">if</span> (is_ok)
  {
    ...
  }

<span class="org-type">bool</span> <span class="org-variable-name">is_java_idiom</span> = <span class="org-constant">false</span>;
<span class="org-type">bool</span> <span class="org-variable-name">is_c_idiom</span> = is_ok &amp;&amp; <span class="org-negation-char">!</span>is_java_idiom;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Les espaces de noms</h2>
<div class="outline-text-2" id="text-6">
<p>
Les espaces de noms sont des zones de déclaration qui permettent de délimiter la
recherche des noms des identificateurs par le compilateur.
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">std</span>;
...
cout &lt;&lt; <span class="org-string">"Standard output"</span> &lt;&lt; endl;
...
</pre>
</div>

<p>
Leur but est principalement d&rsquo;éviter les conflits de noms entre plusieurs
parties d&rsquo;un projet.
</p>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Les espaces de noms</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">namespace</span> <span class="org-constant">utl</span>
{
  <span class="org-type">void</span> <span class="org-function-name">dump</span> () { cout &lt;&lt; <span class="org-string">"utl::dump"</span> &lt;&lt; endl; }
}
<span class="org-keyword">namespace</span> <span class="org-constant">io</span>
{
  <span class="org-type">void</span> <span class="org-function-name">dump</span> () { cout &lt;&lt; <span class="org-string">"io::dump"</span> &lt;&lt; endl; }
}
</pre>
</div>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-comment-delimiter">// </span><span class="org-comment">Utilisation de l'espace de nom io</span>
<span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">io</span>;

<span class="org-type">int</span> <span class="org-function-name">main</span> ()
{
  <span class="org-comment-delimiter">// </span><span class="org-comment">Par d&#233;faut, io::dump ()</span>
  dump ();

  <span class="org-comment-delimiter">// </span><span class="org-comment">Pr&#233;cision de l'espace de nom</span>
  <span class="org-constant">utl</span>::dump ();
  <span class="org-constant">io</span>::dump ();
}
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
